Revit 2027 API
ImportColorMode Enumeration
 An enumerated type listing how colors are handled in an import process.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ImportColorMode
Public Enumeration ImportColorMode
public enum class ImportColorMode
type ImportColorMode
Members
Member name | Value | Description
BlackAndWhite | 2 |  Colors in the imported drawing are converted to Black and White.
Inverted | 1 |  Colors in the imported drawing are inverted.
Preserved | 0 |  Colors in the imported drawing are preserved.
See Also
Reference
Autodesk.Revit.DB Namespace